//     - Є змінна х, якій ви надаєте довільне числове значення.
//     Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3

let x = 1
if (x !== 0){
    console.log('Вірно')
}else {
    console.log('Невірно')
}

let a1 = 1
if (a1 !== 0){
    console.log('Вірно')
}else {
    console.log('Невірно')
}

let a0 = 0
if (a0 !== 0){
    console.log('Вірно')
}else {
    console.log('Невірно')
}

let a3 = -3
if (a3 !== 0){
    console.log('Вірно')
}else {
    console.log('Невірно')
}



// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).

let time = 43
if (time<=14){
    console.log('Перша чверть години')
} else if (time <=29){
    console.log('Друга чверть години')
} else if (time <=44){
    console.log('Третя чверть години')
} else {
    console.log('Четверта чверть години')
}


// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).

let day = 31;
if (day >=1 && day <=10){
    console.log('Перша декада місяця')
} else if (day >=11 && day <=20){
    console.log('Друга декада місяця')
} else if (day >=21 && day <=31){
    console.log('Третя декада місяця')
} else{
    console.log('?????')
}



// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день (можна замість плану на день, назву дня англійською).

let timetable = 1;
switch (timetable) {
    case 1:
        console.log('Monday');
        break;
    case 2:
        console.log('Tuesday');
        break;
    case 3:
        console.log('Wednesday');
        break;
    case 4:
        console.log('Thursday');
        break;
    case 5:
        console.log('Friday');
        break;

    default:
        console.log('?????')
}



//     - Користувач вводить або має два числа.
//         Потрібно знайти та вивести максимальне число з тих двох .
//         Також потрібно врахувати коли введені рівні числа.

let n1 = +prompt('Введіть перше число:')
let n2 = +prompt('Введіть друге число:')

if (n1 > n2){
    console.log(`Число ${n1} є більшим.`)
} else if (n1 < n2){
    console.log(`Число ${n2} є більшим.`)
} else {
    console.log("Введені числа рівні.")
}
